engineer-ae3o/stm32-hal-library/components/drivers/src/spi.c
// DMA transfers API
hal_err_t spi_master_transmit_dma(SPI_TypeDef* handle, const void* data, uint16_t size, dma_done_cb_t cb, void* arg) {
    // Get index for DMA stream mapping
    const uint8_t idx = get_index(handle);
    if (idx == 0xFFU || data == NULL || size == 0) {
        return HAL_ERR_INVALID_ARG;
    }

    // TX mapping
    DMA_Stream_TypeDef* stream = s_spi_i2s_dma_map[idx].tx.stream;
    if (stream == NULL) {
        return HAL_ERR_NOT_SUPPORTED;
    }

    // Set the memory address and transaction length
    dma_set_addresses(stream, &handle->DR, data, NULL);
    dma_set_trans_length(stream, size);

    // Save the user passed callback
    if (cb) {
        s_dma_stream_ctx[idx].tx.callback = cb;
        s_dma_stream_ctx[idx].tx.arg      = arg;
    }

    // Enable the DMA TX stream
    TRY(dma_enable_stream(stream));

    ENABLE_SPI();
    return HAL_OK;
}

hal_err_t spi_master_receive_dma(SPI_TypeDef* handle, void* data, uint16_t size, dma_done_cb_t cb, void* arg) {
    // Get index for DMA stream mapping
    const uint8_t idx = get_index(handle);
    if (idx == 0xFFU || data == NULL || size == 0) {
        return HAL_ERR_INVALID_ARG;
    }

    // RX mapping
    DMA_Stream_TypeDef* stream = s_spi_i2s_dma_map[idx].rx.stream;
    if (stream == NULL) {
        return HAL_ERR_NOT_SUPPORTED;
    }

    // Set the memory address and transaction length
    dma_set_addresses(stream, &handle->DR, data, NULL);
    dma_set_trans_length(stream, size);

    // Save the user passed callback
    if (cb) {
        s_dma_stream_ctx[idx].rx.callback = cb;
        s_dma_stream_ctx[idx].rx.arg      = arg;
    }

    // Enable the DMA TX stream
    TRY(dma_enable_stream(stream));

    ENABLE_SPI();
    return HAL_OK;
}

hal_err_t spi_master_transceive_dma(SPI_TypeDef* handle, const void* tx_data, void* rx_data, uint16_t size, dma_done_cb_t cb, void* arg) {
    // Get index for DMA stream mapping
    const uint8_t idx = get_index(handle);
    if (idx == 0xFFU || tx_data == NULL || rx_data == NULL || size == 0) {
        return HAL_ERR_INVALID_ARG;
    }

    // TX and RX mapping
    DMA_Stream_TypeDef* tx_stream = s_spi_i2s_dma_map[idx].tx.stream;
    DMA_Stream_TypeDef* rx_stream = s_spi_i2s_dma_map[idx].rx.stream;

    if (tx_stream == NULL || rx_stream == NULL) {
        return HAL_ERR_NOT_SUPPORTED;
    }

    // Set the memory address and transaction length
    dma_set_addresses(tx_stream, &handle->DR, tx_data, NULL);
    dma_set_trans_length(tx_stream, size);

    dma_set_addresses(rx_stream, &handle->DR, rx_data, NULL);
    dma_set_trans_length(rx_stream, size);

    // Save the user passed callback
    if (cb) {
        // Save the callback to the TX DMA irq only
        s_dma_stream_ctx[idx].tx.callback = cb;
        s_dma_stream_ctx[idx].tx.arg      = arg;
    }

    // Enable the DMA TX and RX streams
    TRY(dma_enable_stream(rx_stream));
    TRY_WITH_FUNC(dma_enable_stream(tx_stream), dma_disable_stream(rx_stream));

    ENABLE_SPI();
    return HAL_OK;
}


// To be used only by i2s.c to register interrupt handlers and get its DMA stream(s)
hal_err_t spi_master_register_callback(dma_done_cb_t callback, void* arg, uint8_t idx, bool is_tx) {
    if (callback == NULL || idx >= ARRAY_SIZE(s_spi_i2s_dma_map)) {
        return HAL_ERR_INVALID_ARG;
    }
    if (is_tx) {
        s_dma_stream_ctx[idx].tx.callback = callback;
        s_dma_stream_ctx[idx].tx.arg      = arg;
    } else {
        s_dma_stream_ctx[idx].rx.callback = callback;
        s_dma_stream_ctx[idx].rx.arg      = arg;
    }
    return HAL_OK;
}

hal_err_t spi_master_get_dma_stream_map(dma_stream_map_t* map, uint32_t idx) {
    if (map == NULL || idx >= ARRAY_SIZE(s_spi_i2s_dma_map)) {
        return HAL_ERR_INVALID_ARG;
    }
    *map = s_spi_i2s_dma_map[idx];
    return HAL_OK;
}


// DMA interrupts
// SPI2: TX
void DMA1_Stream4_IRQHandler(void) {
    isr_tx_helper(SPI2);
}

// SPI2: RX
void DMA1_Stream3_IRQHandler(void) {
    isr_rx_helper(SPI2);
}

// SPI3: TX
void DMA1_Stream7_IRQHandler(void) {
    isr_tx_helper(SPI3);
}

// SPI3: RX
void DMA1_Stream2_IRQHandler(void) {
    isr_rx_helper(SPI3);
}

// SPI4: TX
void DMA2_Stream1_IRQHandler(void) {
    isr_tx_helper(SPI4);
}

// SPI4: RX
void DMA2_Stream4_IRQHandler(void) {
    isr_rx_helper(SPI4);
}
